tests/artillery/loadParallel.yaml
config:
  target: "http://localhost:8010"
  ensure:
    p99: 50
  phases:
    - duration: 30
      arrivalRate: 100
  http:
    maxSockets: 30

scenarios:
  - flow:
      - parallel:
        - get:
            url: "/rides/2/2"
        - post:
            url: "/rides/"
            json:
              start_lat: 0
              start_long: 0
              end_lat: 0
              end_long: 0
              rider_name: 'string'
              driver_name: 'string'
              driver_vehicle: 'string'
        - get:
            url: "/rides/12"